modules/Car/Blocks/ListCar.php

select * from `bravo_locations` where 0 = 1 and `bravo_locations`.`deleted_at` is null
select `bravo_cars`.* from `bravo_cars` where `bravo_cars`.`status` = 'publish' and `bravo_cars`.`deleted_at` is null group by `bravo_cars`.`id` order by `bravo_cars`.`id` desc limit 6
---
    public function query($model){
        $model_car = Car::select("bravo_cars.*")->with(['location','translations','hasWishList']);
        if(empty($model['order'])) $model['order'] = "id";
        if(empty($model['order_by'])) $model['order_by'] = "desc";
        if(empty($model['number'])) $model['number'] = 5;
        if (!empty($model['location_id'])) {
            $location = Location::where('id', $model['location_id'])->where("status","publish")->first();
            if(!empty($location)){
                $model_car->join('bravo_locations', function ($join) use ($location) {
                    $join->on('bravo_locations.id', '=', 'bravo_cars.location_id')
                        ->where('bravo_locations._lft', '>=', $location->_lft)
                        ->where('bravo_locations._rgt', '<=', $location->_rgt);
                });
            }
        }
        if(!empty($model['is_featured']))
        {
            $model_car->where('bravo_events.is_featured',1);
        }
        if (!empty($model['custom_ids'])) {
            $model_car->whereIn("bravo_events.id", $model['custom_ids']);
        }
        $model_car->orderBy("bravo_cars.".$model['order'], $model['order_by']);
        $model_car->where("bravo_cars.status", "publish");
        $model_car->with('location');
        $model_car->groupBy("bravo_cars.id");
        return $model_car->limit($model['number'])->get();