app/Helpers/AppHelper.php

function get_page_url($page_id)
{
    $page = \Modules\Page\Models\Page::find($page_id);
---
select * from `core_pages` where `core_pages`.`id` = '9' and `core_pages`.`deleted_at` is null limit 1