modules/Core/Models/Settings.php

    public static function getSettings($group = '',$locale = '')
    {
        if ($group) {
            static::where('group', $group);
        }
        $all = static::groupBy('name')->get();
---
select * from `core_settings` group by `name`

    public static function item($item, $default = false)
    {
        $value = Cache::rememberForever('setting_' . $item, function () use ($item ,$default) {
            $val = Settings::where('name', $item)->first();
---
select * from `core_settings` where `name` = 'site_desc' limit 1